Revit 2024 API
LevelAssociationData.GetAssociatedLevel Method
 Returns the Associated Level id.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2023
Syntax
C#
public ElementId GetAssociatedLevel()
Visual Basic
Public Function GetAssociatedLevel As ElementId
Visual C++
public:
ElementId^ GetAssociatedLevel()
See Also
LevelAssociationData Class
Autodesk.Revit.DB Namespace